Revit 2017 API
ExporterIFC.SetSite Method
 Sets the global IfcSite object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This function is deprecated.  This can now be obtained directly from the implementation of the Revit IFC open source.")]
public void SetSite(
	IFCAnyHandle site
)
Visual Basic
<ObsoleteAttribute("This function is deprecated.  This can now be obtained directly from the implementation of the Revit IFC open source.")> _
Public Sub SetSite ( _
	site As IFCAnyHandle _
)
Visual C++
[ObsoleteAttribute(L"This function is deprecated.  This can now be obtained directly from the implementation of the Revit IFC open source.")]
public:
void SetSite(
	IFCAnyHandle^ site
)
Parameters
site
Type: Autodesk.Revit.DB.IFC.IFCAnyHandle
 The IfcSite handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace